# Activty 2-3

- In this activity we will go over what we have learned about the NumPy and pandas modules.

1. Loading NumPy's

    - Load the NumPy module.
    - Create a variable called nmp1 by loading in in the .npy file named `activity2-3.npy`

In [9]:
import numpy as np
nmp1 = np.load('activity2-3.npy')

nmp1

array([[1, 0, 3, 0],
       [2, 2, 2, 0],
       [3, 0, 2, 3]])

2. Create a NumPy

    - Create a NumPy array variable named `nmp2` of the same dimensions as `nmp1` (3x4)
        - You can either create it manually and type in arbitrary numbers or you can use the `np.random.randint()` function and specify the correct `size=`

In [174]:
 nmp2 = np.random.randint(10, size=(3, 4))
    
nmp2

array([[2, 4, 4, 7],
       [2, 2, 0, 7],
       [2, 3, 1, 3]])

3. Show whether the elements of `nmp1` is greater than `nmp2`

In [175]:
nmp1 > nmp2

array([[False, False, False, False],
       [False, False,  True, False],
       [ True, False,  True, False]])

4. Add the two variables together and create a new variable named `nmp3`

    -Print (or simply type the variable name) `nmp3`

In [176]:
nmp3 = nmp1 + nmp2

nmp3

array([[3, 4, 7, 7],
       [4, 4, 2, 7],
       [5, 3, 3, 6]])

5. Find the mean of `nmp3`.

In [177]:
nmp3.mean()

4.583333333333333

6. Save `nmp3` as a file named `problem5`

In [178]:
np.save('problem5', nmp3)

7. Create a dictionary and convert it to a panda.

    - named `fam` which lists three people in your family.

    - This will be a nested dictionary.
        - First list their names.
        - Then make another dictionary for each person which includes thier age, relationship and gender.
        - example:
        
                `myfamily={
                   "Name1": {
                     "age": x,
                     "relationship":'y',
                     "gender":'z' } 
                     }`
     - Convert this dictionary into a pandas dataframe variable named `myfamily`
     - Display your dataframe.

In [179]:
fam = {
  "Jordan" : {
             "age" : 34,
    "relationship" : 'parner',
           "gender": 'male'
  },
  "Ray" : {
             "age" : 53,
    "relationship" : 'Dad',
           "gender": 'male'
  },
  "Jesse" : {
             "age" : 11,
    "relationship" : 'parner',
           "gender": 'male'
  }
}


myfamily = pd.DataFrame(fam)
myfamily

              Jordan   Ray   Jesse
age               34    53      11
relationship  parner   Dad  parner
gender          male  male    male

8. Now transpose you dictionary to a more sensible format (each person is a row)
    - Transposing the variable will not alone overwrite it.
    - Overwrite the `myfamily` variable with the transposed variable

In [180]:
myfamily.T

       age relationship gender
Jordan  34       parner   male
Ray     53          Dad   male
Jesse   11       parner   male

9. Load in a dataset using this web address: https://domlockett.github.io/website/Population.csv
    - Import the pandas module

    - Name the dataset `pop`
    
    - print the first 5 rows in pop.

In [4]:
import pandas as pd
pop = pd.read_csv('https://domlockett.github.io/website/Population.csv')
pop.head()

,Time,Time Code,Country Name,Country Code,"Population, total [SP.POP.TOTL]"
0,1990,YR1990,Afghanistan,AFG,12412308.0
1,1990,YR1990,Albania,ALB,3286542.0
2,1990,YR1990,Algeria,DZA,25758869.0
3,1990,YR1990,American Samoa,ASM,47347.0
4,1990,YR1990,Andorra,AND,54509.0

10. Create a new variable named `pop2` where you drop all the missing variables. Print the head of this new file.

In [189]:
pop2 = pop.dropna()
pop2.head()

   Year Time Code         Country Country Code   Population
0  1990    YR1990     Afghanistan          AFG  12412308.00
1  1990    YR1990         Albania          ALB   3286542.00
2  1990    YR1990         Algeria          DZA  25758869.00
3  1990    YR1990  American Samoa          ASM     47347.00
4  1990    YR1990         Andorra          AND     54509.00

11. Subset the data by column.
    - Make a new variable named `pop3`
    - Keep all the rows.
    - Keep only 3 variables "Year, Country Name and Population"
    - Print the first few observations of the new variable.

In [190]:
pop3 = pop2.loc[:,["Year","Country","Population"]]
pop3.head()

   Year         Country   Population
0  1990     Afghanistan  12412308.00
1  1990         Albania   3286542.00
2  1990         Algeria  25758869.00
3  1990  American Samoa     47347.00
4  1990         Andorra     54509.00

12. Remove any variables in the `Country Name` column whose values are `Not classified`

    - Overwrite the variable pop3 and replace it so that all countries saved as 'Not classified' are removed.

In [191]:
pop3 = pop3[pop3.Country != 'Not classified']

13. Remove any variables in `Population` whose value equals `..`

    - Overwrite the variable pop3 and keep only those values in population that have numbers (i.e. does not equal `..`)

In [192]:
pop3 = pop3[pop3.Population != '..']

14. Sort `pop3` descending by population.
    - Print observations [500:700] of the sorted observations
    - i.e. `pop3.sort_values(by=Z, ascending =Y)[501:699]`

In [194]:
pop3.Population = pop3.Population.astype(float)
pop3.sort_values(by = "Population", ascending = False)[500:700]

      Year   Country   Population
1682  2014     Japan  127276000.0
1946  2015     Japan  127141000.0
2210  2016     Japan  126994511.0
362   2000     Japan  126843000.0
2474  2017     Japan  126785797.0
...    ...       ...          ...
707   2010     Spain   46576897.0
1362  2013  Colombia   46497267.0
2291  2016     Spain   46484062.0
1763  2014     Spain   46480882.0
2027  2015     Spain   46444832.0

[200 rows x 3 columns]

## 10. Make and edit a dataframe.
- ### A. Create a copy named `df2` that does not impact the original dataframe when altered.
- ### B. Add a new column `E` to the dataset which is equal to 'yes' if column `B` is less than 50 and 'no' otherwise. 
- ### C. Make all the column names (`A`,`B`,`C`,`D`,`E`) lowercase.

In [11]:
df = pd.DataFrame(np.random.randint(0,100,size=(100, 4)), columns=list('ABCD')) #np.random.randint(start.value, end.value., size = (#rows, #columns))
df

     A   B   C   D
0   44  75  70  69
1   18  15  37  86
2   73  99  56  84
3   48   6  97  56
4   29  61  38  62
..  ..  ..  ..  ..
95  28  41  51  95
96  25  69   8  31
97  45  67   6  80
98  84  46   5  46
99  11  69  20  49

[100 rows x 4 columns]

In [12]:
#type your solution to A below this line:

df2 = df.copy()

In [14]:
#type your solution to B below this line:

df2['E'] = np.where(df['B'] < 50, 'yes','no')
df2

     A   B   C   D    E
0   44  75  70  69   no
1   18  15  37  86  yes
2   73  99  56  84   no
3   48   6  97  56  yes
4   29  61  38  62   no
..  ..  ..  ..  ..  ...
95  28  41  51  95  yes
96  25  69   8  31   no
97  45  67   6  80   no
98  84  46   5  46  yes
99  11  69  20  49   no

[100 rows x 5 columns]

In [16]:
#type your solution to C below this line:

df2.columns = ['a','b','c','d','e']
df2

     a   b   c   d    e
0   44  75  70  69   no
1   18  15  37  86  yes
2   73  99  56  84   no
3   48   6  97  56  yes
4   29  61  38  62   no
..  ..  ..  ..  ..  ...
95  28  41  51  95  yes
96  25  69   8  31   no
97  45  67   6  80   no
98  84  46   5  46  yes
99  11  69  20  49   no

[100 rows x 5 columns]